# Pandas

In [3]:
import pandas as pd

## 1. 시리즈(Series)

In [4]:
# 시리즈 생성
s = pd.Series( [9904312, 3448737, 2890451, 2466052], index = ['서울','부산','인천','대구'] )
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [5]:
pd.Series(range(10, 14))

0    10
1    11
2    12
3    13
dtype: int64

In [6]:
s.index  #인덱스확인

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [7]:
s.values #값 확인

array([9904312, 3448737, 2890451, 2466052])

In [8]:
# name 속성을 이용하여 시리즈 데이터에 이름을 붙일 수 있음
s.name = '인구'
s.index.name = '도시'
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

- 시리즈 연산

In [9]:
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

- 시리즈 인덱싱

In [10]:
s[0], s['서울']

(9904312, 9904312)

In [11]:
s[ [0,2] ]

도시
서울    9904312
인천    2890451
Name: 인구, dtype: int64

In [12]:
s[ ['부산','대구'] ]

도시
부산    3448737
대구    2466052
Name: 인구, dtype: int64

- Slicing

In [13]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [14]:
#문자열 라벨 이용하면 : 뒤의 값도 포함
s['부산':'대구'] #문자로 슬라이싱하면, '대구'도 포함되어 나온다

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

- Boolean indexing

In [15]:
s[s < 3000000] #s의 값이 3000000 보다 작은 것만 추출

도시
인천    2890451
대구    2466052
Name: 인구, dtype: int64

- 편리한 인덱싱

In [16]:
s.head()

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [17]:
s.서울, s.대구

(9904312, 2466052)

- 시리즈와 딕셔너리 자료형

In [19]:
for k, v in s.items():   #.items():  Key와 Value의 쌍을 튜플로 묶은 값을 리스트로 돌려준다
    print(f' {k} = {v} ')

 서울 = 9904312
 부산 = 3448737
 인천 = 2890451
 대구 = 2466052

In [20]:
fruits = { 'apple':1000, 'banana':2000, 'cherry':3000 }
f = pd.Series(fruits)
f

apple     1000
banana    2000
cherry    3000
dtype: int64

## 2. 데이터 프레임(DataFrame)

In [22]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
df = pd.DataFrame(data)
df

      2015     2010     2005     2000   지역  2010-2015 증가율
0  9904312  9631482  9762546  9853972  수도권         0.0283
1  3448737  3393191  3512547  3655437  경상권         0.0163
2  2890451  2632035  2517680  2466338  수도권         0.0982
3  2466052  2431774  2456016  2473990  경상권         0.0141

In [24]:
index = ['서울', '부산', '인천', '대구']
df.index = index
df

       2015     2010     2005     2000   지역  2010-2015 증가율
서울  9904312  9631482  9762546  9853972  수도권         0.0283
부산  3448737  3393191  3512547  3655437  경상권         0.0163
인천  2890451  2632035  2517680  2466338  수도권         0.0982
대구  2466052  2431774  2456016  2473990  경상권         0.0141

In [27]:
columns = ['지역','2015','2010','2005','2000','2010~2015 증가율']
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000 2010~2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           NaN
부산  경상권  3448737  3393191  3512547  3655437           NaN
인천  수도권  2890451  2632035  2517680  2466338           NaN
대구  경상권  2466052  2431774  2456016  2473990           NaN

In [28]:
df.values  #데이터만 접근

array([['수도권', 9904312, 9631482, 9762546, 9853972, nan],
       ['경상권', 3448737, 3393191, 3512547, 3655437, nan],
       ['수도권', 2890451, 2632035, 2517680, 2466338, nan],
       ['경상권', 2466052, 2431774, 2456016, 2473990, nan]], dtype=object)

In [29]:
df.index.name ='도시'
df.columns.name='특성'
df

특성   지역     2015     2010     2005     2000 2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           NaN
부산  경상권  3448737  3393191  3512547  3655437           NaN
인천  수도권  2890451  2632035  2517680  2466338           NaN
대구  경상권  2466052  2431774  2456016  2473990           NaN

In [30]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010~2015 증가율      NaN      NaN      NaN      NaN

- 열 데이터

In [32]:
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [34]:
# 새로운 칼럼 추가하기
df['temp'] = [1,2,3,4]

In [37]:
# 새로운 칼럼 생성시에는 .칼럼명 사용불가
df.temp = [1,2,3,4]

In [35]:
df

특성   지역     2015     2010     2005     2000 2010~2015 증가율  temp
도시
서울  수도권  9904312  9631482  9762546  9853972           NaN     1
부산  경상권  3448737  3393191  3512547  3655437           NaN     2
인천  수도권  2890451  2632035  2517680  2466338           NaN     3
대구  경상권  2466052  2431774  2456016  2473990           NaN     4

In [38]:
# 칼럼 수정
df['temp'] = [5,6,7,8]
df

특성   지역     2015     2010     2005     2000 2010~2015 증가율  temp
도시
서울  수도권  9904312  9631482  9762546  9853972           NaN     5
부산  경상권  3448737  3393191  3512547  3655437           NaN     6
인천  수도권  2890451  2632035  2517680  2466338           NaN     7
대구  경상권  2466052  2431774  2456016  2473990           NaN     8

In [39]:
# 칼럼 삭제
del df['temp']
df

특성   지역     2015     2010     2005     2000 2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           NaN
부산  경상권  3448737  3393191  3512547  3655437           NaN
인천  수도권  2890451  2632035  2517680  2466338           NaN
대구  경상권  2466052  2431774  2456016  2473990           NaN

- 열 인덱싱

In [40]:
df['2010'] #하나의 값을 인덱싱하면 시리즈가 반환

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [42]:
df[ ['2010','2010'] 
#여러개 동시에 인덱싱하려면, 리스트에 감싸야한다.
#리스트를 써서 인덱싱하면 데이터프레임이 반환된다.

특성     2010     2010
도시
서울  9631482  9631482
부산  3393191  3393191
인천  2632035  2632035
대구  2431774  2431774

In [44]:
df[ ['2010'] ] #리스트 사용시, 데이터프레임 반환

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

- 행 인덱싱

: 행 단위로 인덱싱 하고자 하면, 항상 슬라이싱을 해야한다.

인덱스 값이 문자 라벨이면, 라벨 슬라이싱도 가능하다.

In [50]:
df.head()

특성   지역     2015     2010     2005     2000 2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           NaN
부산  경상권  3448737  3393191  3512547  3655437           NaN
인천  수도권  2890451  2632035  2517680  2466338           NaN
대구  경상권  2466052  2431774  2456016  2473990           NaN

In [51]:
df[:1] #처음~0까지

특성   지역     2015     2010     2005     2000 2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           NaN

In [52]:
df[1:2] #슬라이싱의 마지막은 포함이 안된다는 것 기억하자. 1~1

특성   지역     2015     2010     2005     2000 2010~2015 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           NaN

In [53]:
df[1:3] #1~2

특성   지역     2015     2010     2005     2000 2010~2015 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           NaN
인천  수도권  2890451  2632035  2517680  2466338           NaN

In [58]:
df['서울':'부산']
#문자 라벨 슬라이싱 적용시, '부산' 까지 모두 포함

특성   지역     2015     2010     2005     2000 2010~2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           NaN
부산  경상권  3448737  3393191  3512547  3655437           NaN

In [61]:
df['지역']['서울']
#    열      행

'수도권'

In [69]:
# 가장 보편적으로 사용됨

df['2015'][1]
# 컬럼name/행인덱스

3448737

In [70]:
# 익숙해지면 이렇게 사용

df.지역[0]
# 열/행인덱스

'수도권'

In [74]:
df.지역.서울
# 열인덱스.행인덱스

'수도권'